// -------------------------------------------------------------------------------------------------
// 予定詳細ポップアップ
// -------------------------------------------------------------------------------------------------
// 【ポップアップの流れ】
// ・クリックされる
// ・通知する
// ・html上に既に隠してある項目を表示する
// -------------------------------------------------------------------------------------------------
$(function() {
    // モーダルのボタンをクリックした時
    $('.taskDetailPopupButton').on('click', function() {
        // 何番目のモーダルボタンかを取得
        // var 【変数名(クリックされたモーダルボタンが何番目の物なのかも数字が入る)】= $('【カウントしたいタグ名やclass、id名】').index(this);
        var buttonIndex = $('.taskDetailPopupButton').index(this);
        // クリックしたモーダルボタンと同じ番目のモーダルを表示する
        // eq : 複数のHTML要素の中からインデックス番号を指定することで特定の要素だけを取得する
        $('.taskDetailPopup').eq(buttonIndex).fadeIn();
    });
  
    // ×ボタンをクリックした時
    $('.closeButton').click(function(){
        // モーダルを非表示にする
      $('.taskDetailPopup').fadeOut();
    });
  });

// -------------------------------------------------------------------------------------------------
// 予定詳細ポップアップが起動している状態で起動するポップアップ
// -------------------------------------------------------------------------------------------------
$(function() {
  // モーダルのボタンをクリックした時
  $('.innerPopupButton').on('click', function() {
      // 何番目のモーダルボタンかを取得
      // var 【変数名(クリックされたモーダルボタンが何番目の物なのかも数字が入る)】= $('【カウントしたいタグ名やclass、id名】').index(this);
      var innerButtonIndex = $('.innerPopupButton').index(this);
      // クリックしたモーダルボタンと同じ番目のモーダルを表示する
      // eq : 複数のHTML要素の中からインデックス番号を指定することで特定の要素だけを取得する
      $('.innnerPopup').eq(innerButtonIndex).fadeIn();
  });

  // 閉じるボタンをクリックした時
  $('.innerCloseButton').click(function(){
      // モーダルを非表示にする
    $('.innerPopup').fadeOut();
  });
});

// -------------------------------------------------------------------------------------------------
// にょきっとばー
// -------------------------------------------------------------------------------------------------
$(function($) {
  WindowHeight = $(window).height();
   //メニューをウィンドウの高さにする
  $('.drawrMenu').css('height', WindowHeight);

  $(document).ready(function() {
    $('.drawrOpenBtn').click(function(){
      if($('.drawrMenu').is(":animated")){
        return false;
      }else{
        //animateで表示・非表示
        $('.drawrMenu').animate({width:'toggle'});
        //toggleでクラス追加・削除
        $(this).toggleClass('menuCloseBtn');
       return false;
      }
    });
  });

//別領域をクリックでメニューを閉じる
  $(document).click(function(event) {
    if (!$(event.target).closest('.drawrMenu').length) {
      $('.drawrOpenBtn').removeClass('menuCloseBtn');
      $('.drawrMenu').hide();
    }
  });
});

// -------------------------------------------------------------------------------------------------
// テンプレ―トを削除するページのjs
// -------------------------------------------------------------------------------------------------
	$(document).ready(function(){
       $('section').hide();
    });
	
   $('select').change(function () {
   var val = $('select option:selected').val();
   if (val == 'temp_select'){
       $('section').hide();
        return;
   }
   $('section').fadeOut();
   $('section#' + val ).fadeIn();
   });
       
// -------------------------------------------------------------------------------------------------
// テンプレ―トを追加するjs
// -------------------------------------------------------------------------------------------------
$(function() {
  // モーダルのボタンをクリックした時
  $('.addPopupButton').on('click', function() {
      // 何番目のモーダルボタンかを取得
      // var 【変数名(クリックされたモーダルボタンが何番目の物なのかも数字が入る)】= $('【カウントしたいタグ名やclass、id名】').index(this);
      var buttonIndex = $('.addPopupButton').index(this);
      // クリックしたモーダルボタンと同じ番目のモーダルを表示する
      // eq : 複数のHTML要素の中からインデックス番号を指定することで特定の要素だけを取得する
      $('.addPopup').eq(buttonIndex).fadeIn();
  });

  // ×ボタンをクリックした時
  $('.addPopCloseButton').click(function(){
      // モーダルを非表示にする
    $('.addPopup').fadeOut();
  });
});

// -------------------------------------------------------------------------------------------------
// テンプレ―トを追加するポップアップを開くためのjs
// -------------------------------------------------------------------------------------------------
function deleteTextSubmit(){
  document.deleteForm.mode.value = "deleteText";
  document.deleteForm.submit();
}


// -------------------------------------------------------------------------------------------------
// タスクを削除するためのやつ
// -------------------------------------------------------------------------------------------------
// $(function() {
//   // モーダルのボタンをクリックした時
//   $('.deleteButton').on('click', function() {
//     $result = window.confirm('本当に削除しますか？');
//     if($result){
//       {{route('index') }} 
//     }
//   });
// });
